#include "include.h"


void Print(int N) {
    
    if (vedom[0].name != "") {
        cout << setiosflags(ios::left); //Для вывода по левую сторону, ровный вывод
        cout << "----------------------------------------------" << endl;
        cout << "|         Ведомость комплектующих            |" << endl;
        cout << "|--------------------------------------------|" << endl;
        cout << "| Обозначение | Тип |  Номинал  | Количество |" << endl;
        cout << "|-------------|-----|-----------|------------|" << endl;
        for (int i = 0; i < N; i++) {
            cout << "|" << setw(13) << vedom[i].name << "|" << setw(5) << vedom[i].typ << "|" << setw(11) << vedom[i].nom << "|" << setw(12) << vedom[i].colvo << "|" << endl;
            cout << "|--------------------------------------------|" << endl;
        }
        cout << "Выберите дальнейшее действие.\n" << endl;
    }
    else {
        cout << "Таблица пуста. Пожалуйста заполните сперва таблицу.\n" << endl;
    }
}
